garyPenhook/PIC-Assembler/device_includes/pic16f13125.inc
// Register: CLBCON
#define CLBCON CLBCON
CLBCON                                   equ 050Ch
// bitfield definitions
CLBCON_BUSY_POSN                         equ 0000h
CLBCON_BUSY_POSITION                     equ 0000h
CLBCON_BUSY_SIZE                         equ 0001h
CLBCON_BUSY_LENGTH                       equ 0001h
CLBCON_BUSY_MASK                         equ 0001h
CLBCON_EN_POSN                           equ 0007h
CLBCON_EN_POSITION                       equ 0007h
CLBCON_EN_SIZE                           equ 0001h
CLBCON_EN_LENGTH                         equ 0001h
CLBCON_EN_MASK                           equ 0080h
CLBCON_CLBEN_POSN                        equ 0007h
CLBCON_CLBEN_POSITION                    equ 0007h
CLBCON_CLBEN_SIZE                        equ 0001h
CLBCON_CLBEN_LENGTH                      equ 0001h
CLBCON_CLBEN_MASK                        equ 0080h

// Register: CLBSWINU
#define CLBSWINU CLBSWINU
CLBSWINU                                 equ 050Dh
// bitfield definitions
CLBSWINU_CLBSWINU_POSN                   equ 0000h
CLBSWINU_CLBSWINU_POSITION               equ 0000h
CLBSWINU_CLBSWINU_SIZE                   equ 0008h
CLBSWINU_CLBSWINU_LENGTH                 equ 0008h
CLBSWINU_CLBSWINU_MASK                   equ 00FFh
CLBSWINU_CLBSWIN24_POSN                  equ 0000h
CLBSWINU_CLBSWIN24_POSITION              equ 0000h
CLBSWINU_CLBSWIN24_SIZE                  equ 0001h
CLBSWINU_CLBSWIN24_LENGTH                equ 0001h
CLBSWINU_CLBSWIN24_MASK                  equ 0001h
CLBSWINU_CLBSWIN25_POSN                  equ 0001h
CLBSWINU_CLBSWIN25_POSITION              equ 0001h
CLBSWINU_CLBSWIN25_SIZE                  equ 0001h
CLBSWINU_CLBSWIN25_LENGTH                equ 0001h
CLBSWINU_CLBSWIN25_MASK                  equ 0002h
CLBSWINU_CLBSWIN26_POSN                  equ 0002h
CLBSWINU_CLBSWIN26_POSITION              equ 0002h
CLBSWINU_CLBSWIN26_SIZE                  equ 0001h
CLBSWINU_CLBSWIN26_LENGTH                equ 0001h
CLBSWINU_CLBSWIN26_MASK                  equ 0004h
CLBSWINU_CLBSWIN27_POSN                  equ 0003h
CLBSWINU_CLBSWIN27_POSITION              equ 0003h
CLBSWINU_CLBSWIN27_SIZE                  equ 0001h
CLBSWINU_CLBSWIN27_LENGTH                equ 0001h
CLBSWINU_CLBSWIN27_MASK                  equ 0008h
CLBSWINU_CLBSWIN28_POSN                  equ 0004h
CLBSWINU_CLBSWIN28_POSITION              equ 0004h
CLBSWINU_CLBSWIN28_SIZE                  equ 0001h
CLBSWINU_CLBSWIN28_LENGTH                equ 0001h
CLBSWINU_CLBSWIN28_MASK                  equ 0010h
CLBSWINU_CLBSWIN29_POSN                  equ 0005h
CLBSWINU_CLBSWIN29_POSITION              equ 0005h
CLBSWINU_CLBSWIN29_SIZE                  equ 0001h
CLBSWINU_CLBSWIN29_LENGTH                equ 0001h
CLBSWINU_CLBSWIN29_MASK                  equ 0020h
CLBSWINU_CLBSWIN30_POSN                  equ 0006h
CLBSWINU_CLBSWIN30_POSITION              equ 0006h
CLBSWINU_CLBSWIN30_SIZE                  equ 0001h
CLBSWINU_CLBSWIN30_LENGTH                equ 0001h
CLBSWINU_CLBSWIN30_MASK                  equ 0040h
CLBSWINU_CLBSWIN31_POSN                  equ 0007h
CLBSWINU_CLBSWIN31_POSITION              equ 0007h
CLBSWINU_CLBSWIN31_SIZE                  equ 0001h
CLBSWINU_CLBSWIN31_LENGTH                equ 0001h
CLBSWINU_CLBSWIN31_MASK                  equ 0080h

// Register: CLBSWINH
#define CLBSWINH CLBSWINH
CLBSWINH                                 equ 050Eh
// bitfield definitions
CLBSWINH_CLBSWINH_POSN                   equ 0000h
CLBSWINH_CLBSWINH_POSITION               equ 0000h
CLBSWINH_CLBSWINH_SIZE                   equ 0008h
CLBSWINH_CLBSWINH_LENGTH                 equ 0008h
CLBSWINH_CLBSWINH_MASK                   equ 00FFh
CLBSWINH_CLBSWIN16_POSN                  equ 0000h
CLBSWINH_CLBSWIN16_POSITION              equ 0000h
CLBSWINH_CLBSWIN16_SIZE                  equ 0001h
CLBSWINH_CLBSWIN16_LENGTH                equ 0001h
CLBSWINH_CLBSWIN16_MASK                  equ 0001h
CLBSWINH_CLBSWIN17_POSN                  equ 0001h
CLBSWINH_CLBSWIN17_POSITION              equ 0001h
CLBSWINH_CLBSWIN17_SIZE                  equ 0001h
CLBSWINH_CLBSWIN17_LENGTH                equ 0001h
CLBSWINH_CLBSWIN17_MASK                  equ 0002h
CLBSWINH_CLBSWIN18_POSN                  equ 0002h
CLBSWINH_CLBSWIN18_POSITION              equ 0002h
CLBSWINH_CLBSWIN18_SIZE                  equ 0001h
CLBSWINH_CLBSWIN18_LENGTH                equ 0001h
CLBSWINH_CLBSWIN18_MASK                  equ 0004h
CLBSWINH_CLBSWIN19_POSN                  equ 0003h
CLBSWINH_CLBSWIN19_POSITION              equ 0003h
CLBSWINH_CLBSWIN19_SIZE                  equ 0001h
CLBSWINH_CLBSWIN19_LENGTH                equ 0001h
CLBSWINH_CLBSWIN19_MASK                  equ 0008h
CLBSWINH_CLBSWIN20_POSN                  equ 0004h
CLBSWINH_CLBSWIN20_POSITION              equ 0004h
CLBSWINH_CLBSWIN20_SIZE                  equ 0001h
CLBSWINH_CLBSWIN20_LENGTH                equ 0001h
CLBSWINH_CLBSWIN20_MASK                  equ 0010h
CLBSWINH_CLBSWIN21_POSN                  equ 0005h
CLBSWINH_CLBSWIN21_POSITION              equ 0005h
CLBSWINH_CLBSWIN21_SIZE                  equ 0001h
CLBSWINH_CLBSWIN21_LENGTH                equ 0001h
CLBSWINH_CLBSWIN21_MASK                  equ 0020h
CLBSWINH_CLBSWIN22_POSN                  equ 0006h
CLBSWINH_CLBSWIN22_POSITION              equ 0006h
CLBSWINH_CLBSWIN22_SIZE                  equ 0001h
CLBSWINH_CLBSWIN22_LENGTH                equ 0001h
CLBSWINH_CLBSWIN22_MASK                  equ 0040h
CLBSWINH_CLBSWIN23_POSN                  equ 0007h
CLBSWINH_CLBSWIN23_POSITION              equ 0007h
CLBSWINH_CLBSWIN23_SIZE                  equ 0001h
CLBSWINH_CLBSWIN23_LENGTH                equ 0001h
CLBSWINH_CLBSWIN23_MASK                  equ 0080h

// Register: CLBSWINM
#define CLBSWINM CLBSWINM
CLBSWINM                                 equ 050Fh
// bitfield definitions
CLBSWINM_CLBSWINM_POSN                   equ 0000h
CLBSWINM_CLBSWINM_POSITION               equ 0000h
CLBSWINM_CLBSWINM_SIZE                   equ 0008h
CLBSWINM_CLBSWINM_LENGTH                 equ 0008h
CLBSWINM_CLBSWINM_MASK                   equ 00FFh
CLBSWINM_CLBSWIN8_POSN                   equ 0000h
CLBSWINM_CLBSWIN8_POSITION               equ 0000h
CLBSWINM_CLBSWIN8_SIZE                   equ 0001h
CLBSWINM_CLBSWIN8_LENGTH                 equ 0001h
CLBSWINM_CLBSWIN8_MASK                   equ 0001h
CLBSWINM_CLBSWIN9_POSN                   equ 0001h
CLBSWINM_CLBSWIN9_POSITION               equ 0001h
CLBSWINM_CLBSWIN9_SIZE                   equ 0001h
CLBSWINM_CLBSWIN9_LENGTH                 equ 0001h
CLBSWINM_CLBSWIN9_MASK                   equ 0002h
CLBSWINM_CLBSWIN10_POSN                  equ 0002h
CLBSWINM_CLBSWIN10_POSITION              equ 0002h
CLBSWINM_CLBSWIN10_SIZE                  equ 0001h
CLBSWINM_CLBSWIN10_LENGTH                equ 0001h
CLBSWINM_CLBSWIN10_MASK                  equ 0004h
CLBSWINM_CLBSWIN11_POSN                  equ 0003h
CLBSWINM_CLBSWIN11_POSITION              equ 0003h
CLBSWINM_CLBSWIN11_SIZE                  equ 0001h
CLBSWINM_CLBSWIN11_LENGTH                equ 0001h
CLBSWINM_CLBSWIN11_MASK                  equ 0008h
CLBSWINM_CLBSWIN12_POSN                  equ 0004h
CLBSWINM_CLBSWIN12_POSITION              equ 0004h
CLBSWINM_CLBSWIN12_SIZE                  equ 0001h
CLBSWINM_CLBSWIN12_LENGTH                equ 0001h
CLBSWINM_CLBSWIN12_MASK                  equ 0010h
CLBSWINM_CLBSWIN13_POSN                  equ 0005h
CLBSWINM_CLBSWIN13_POSITION              equ 0005h
CLBSWINM_CLBSWIN13_SIZE                  equ 0001h
CLBSWINM_CLBSWIN13_LENGTH                equ 0001h
CLBSWINM_CLBSWIN13_MASK                  equ 0020h
CLBSWINM_CLBSWIN14_POSN                  equ 0006h
CLBSWINM_CLBSWIN14_POSITION              equ 0006h
CLBSWINM_CLBSWIN14_SIZE                  equ 0001h
CLBSWINM_CLBSWIN14_LENGTH                equ 0001h
CLBSWINM_CLBSWIN14_MASK                  equ 0040h
CLBSWINM_CLBSWIN15_POSN                  equ 0007h
CLBSWINM_CLBSWIN15_POSITION              equ 0007h
CLBSWINM_CLBSWIN15_SIZE                  equ 0001h
CLBSWINM_CLBSWIN15_LENGTH                equ 0001h
CLBSWINM_CLBSWIN15_MASK                  equ 0080h

// Register: CLBSWINL
#define CLBSWINL CLBSWINL
CLBSWINL                                 equ 0510h
// bitfield definitions
CLBSWINL_CLBSWINL_POSN                   equ 0000h
CLBSWINL_CLBSWINL_POSITION               equ 0000h
CLBSWINL_CLBSWINL_SIZE                   equ 0008h
CLBSWINL_CLBSWINL_LENGTH                 equ 0008h
CLBSWINL_CLBSWINL_MASK                   equ 00FFh
CLBSWINL_CLBSWIN0_POSN                   equ 0000h
CLBSWINL_CLBSWIN0_POSITION               equ 0000h
CLBSWINL_CLBSWIN0_SIZE                   equ 0001h
CLBSWINL_CLBSWIN0_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN0_MASK                   equ 0001h
CLBSWINL_CLBSWIN1_POSN                   equ 0001h
CLBSWINL_CLBSWIN1_POSITION               equ 0001h
CLBSWINL_CLBSWIN1_SIZE                   equ 0001h
CLBSWINL_CLBSWIN1_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN1_MASK                   equ 0002h
CLBSWINL_CLBSWIN2_POSN                   equ 0002h
CLBSWINL_CLBSWIN2_POSITION               equ 0002h
CLBSWINL_CLBSWIN2_SIZE                   equ 0001h
CLBSWINL_CLBSWIN2_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN2_MASK                   equ 0004h
CLBSWINL_CLBSWIN3_POSN                   equ 0003h
CLBSWINL_CLBSWIN3_POSITION               equ 0003h
CLBSWINL_CLBSWIN3_SIZE                   equ 0001h
CLBSWINL_CLBSWIN3_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN3_MASK                   equ 0008h
CLBSWINL_CLBSWIN4_POSN                   equ 0004h
CLBSWINL_CLBSWIN4_POSITION               equ 0004h
CLBSWINL_CLBSWIN4_SIZE                   equ 0001h
CLBSWINL_CLBSWIN4_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN4_MASK                   equ 0010h
CLBSWINL_CLBSWIN5_POSN                   equ 0005h
CLBSWINL_CLBSWIN5_POSITION               equ 0005h
CLBSWINL_CLBSWIN5_SIZE                   equ 0001h
CLBSWINL_CLBSWIN5_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN5_MASK                   equ 0020h
CLBSWINL_CLBSWIN6_POSN                   equ 0006h
CLBSWINL_CLBSWIN6_POSITION               equ 0006h
CLBSWINL_CLBSWIN6_SIZE                   equ 0001h
CLBSWINL_CLBSWIN6_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN6_MASK                   equ 0040h
CLBSWINL_CLBSWIN7_POSN                   equ 0007h
CLBSWINL_CLBSWIN7_POSITION               equ 0007h
CLBSWINL_CLBSWIN7_SIZE                   equ 0001h
CLBSWINL_CLBSWIN7_LENGTH                 equ 0001h
CLBSWINL_CLBSWIN7_MASK                   equ 0080h

