garyPenhook/PIC-Assembler/device_includes/pic16f13125.inc
// Register: CRCCON1
#define CRCCON1 CRCCON1
CRCCON1                                  equ 01CA6h
// bitfield definitions
CRCCON1_PLEN_POSN                        equ 0000h
CRCCON1_PLEN_POSITION                    equ 0000h
CRCCON1_PLEN_SIZE                        equ 0005h
CRCCON1_PLEN_LENGTH                      equ 0005h
CRCCON1_PLEN_MASK                        equ 001Fh
CRCCON1_PLEN0_POSN                       equ 0000h
CRCCON1_PLEN0_POSITION                   equ 0000h
CRCCON1_PLEN0_SIZE                       equ 0001h
CRCCON1_PLEN0_LENGTH                     equ 0001h
CRCCON1_PLEN0_MASK                       equ 0001h
CRCCON1_PLEN1_POSN                       equ 0001h
CRCCON1_PLEN1_POSITION                   equ 0001h
CRCCON1_PLEN1_SIZE                       equ 0001h
CRCCON1_PLEN1_LENGTH                     equ 0001h
CRCCON1_PLEN1_MASK                       equ 0002h
CRCCON1_PLEN2_POSN                       equ 0002h
CRCCON1_PLEN2_POSITION                   equ 0002h
CRCCON1_PLEN2_SIZE                       equ 0001h
CRCCON1_PLEN2_LENGTH                     equ 0001h
CRCCON1_PLEN2_MASK                       equ 0004h
CRCCON1_PLEN3_POSN                       equ 0003h
CRCCON1_PLEN3_POSITION                   equ 0003h
CRCCON1_PLEN3_SIZE                       equ 0001h
CRCCON1_PLEN3_LENGTH                     equ 0001h
CRCCON1_PLEN3_MASK                       equ 0008h
CRCCON1_PLEN4_POSN                       equ 0004h
CRCCON1_PLEN4_POSITION                   equ 0004h
CRCCON1_PLEN4_SIZE                       equ 0001h
CRCCON1_PLEN4_LENGTH                     equ 0001h
CRCCON1_PLEN4_MASK                       equ 0010h

// Register: CRCCON2
#define CRCCON2 CRCCON2
CRCCON2                                  equ 01CA7h
// bitfield definitions
CRCCON2_DLEN_POSN                        equ 0000h
CRCCON2_DLEN_POSITION                    equ 0000h
CRCCON2_DLEN_SIZE                        equ 0005h
CRCCON2_DLEN_LENGTH                      equ 0005h
CRCCON2_DLEN_MASK                        equ 001Fh
CRCCON2_DLEN0_POSN                       equ 0000h
CRCCON2_DLEN0_POSITION                   equ 0000h
CRCCON2_DLEN0_SIZE                       equ 0001h
CRCCON2_DLEN0_LENGTH                     equ 0001h
CRCCON2_DLEN0_MASK                       equ 0001h
CRCCON2_DLEN1_POSN                       equ 0001h
CRCCON2_DLEN1_POSITION                   equ 0001h
CRCCON2_DLEN1_SIZE                       equ 0001h
CRCCON2_DLEN1_LENGTH                     equ 0001h
CRCCON2_DLEN1_MASK                       equ 0002h
CRCCON2_DLEN2_POSN                       equ 0002h
CRCCON2_DLEN2_POSITION                   equ 0002h
CRCCON2_DLEN2_SIZE                       equ 0001h
CRCCON2_DLEN2_LENGTH                     equ 0001h
CRCCON2_DLEN2_MASK                       equ 0004h
CRCCON2_DLEN3_POSN                       equ 0003h
CRCCON2_DLEN3_POSITION                   equ 0003h
CRCCON2_DLEN3_SIZE                       equ 0001h
CRCCON2_DLEN3_LENGTH                     equ 0001h
CRCCON2_DLEN3_MASK                       equ 0008h
CRCCON2_DLEN4_POSN                       equ 0004h
CRCCON2_DLEN4_POSITION                   equ 0004h
CRCCON2_DLEN4_SIZE                       equ 0001h
CRCCON2_DLEN4_LENGTH                     equ 0001h
CRCCON2_DLEN4_MASK                       equ 0010h

// Register: ADLTHL
#define ADLTHL ADLTHL
ADLTHL                                   equ 01D0Ch
// bitfield definitions
ADLTHL_LTH_POSN                          equ 0000h
ADLTHL_LTH_POSITION                      equ 0000h
ADLTHL_LTH_SIZE                          equ 0008h
ADLTHL_LTH_LENGTH                        equ 0008h
ADLTHL_LTH_MASK                          equ 00FFh
ADLTHL_ADLTH0_POSN                       equ 0000h
ADLTHL_ADLTH0_POSITION                   equ 0000h
ADLTHL_ADLTH0_SIZE                       equ 0001h
ADLTHL_ADLTH0_LENGTH                     equ 0001h
ADLTHL_ADLTH0_MASK                       equ 0001h
ADLTHL_ADLTH1_POSN                       equ 0001h
ADLTHL_ADLTH1_POSITION                   equ 0001h
ADLTHL_ADLTH1_SIZE                       equ 0001h
ADLTHL_ADLTH1_LENGTH                     equ 0001h
ADLTHL_ADLTH1_MASK                       equ 0002h
ADLTHL_ADLTH2_POSN                       equ 0002h
ADLTHL_ADLTH2_POSITION                   equ 0002h
ADLTHL_ADLTH2_SIZE                       equ 0001h
ADLTHL_ADLTH2_LENGTH                     equ 0001h
ADLTHL_ADLTH2_MASK                       equ 0004h
ADLTHL_ADLTH3_POSN                       equ 0003h
ADLTHL_ADLTH3_POSITION                   equ 0003h
ADLTHL_ADLTH3_SIZE                       equ 0001h
ADLTHL_ADLTH3_LENGTH                     equ 0001h
ADLTHL_ADLTH3_MASK                       equ 0008h
ADLTHL_ADLTH4_POSN                       equ 0004h
ADLTHL_ADLTH4_POSITION                   equ 0004h
ADLTHL_ADLTH4_SIZE                       equ 0001h
ADLTHL_ADLTH4_LENGTH                     equ 0001h
ADLTHL_ADLTH4_MASK                       equ 0010h
ADLTHL_ADLTH5_POSN                       equ 0005h
ADLTHL_ADLTH5_POSITION                   equ 0005h
ADLTHL_ADLTH5_SIZE                       equ 0001h
ADLTHL_ADLTH5_LENGTH                     equ 0001h
ADLTHL_ADLTH5_MASK                       equ 0020h
ADLTHL_ADLTH6_POSN                       equ 0006h
ADLTHL_ADLTH6_POSITION                   equ 0006h
ADLTHL_ADLTH6_SIZE                       equ 0001h
ADLTHL_ADLTH6_LENGTH                     equ 0001h
ADLTHL_ADLTH6_MASK                       equ 0040h
ADLTHL_ADLTH7_POSN                       equ 0007h
ADLTHL_ADLTH7_POSITION                   equ 0007h
ADLTHL_ADLTH7_SIZE                       equ 0001h
ADLTHL_ADLTH7_LENGTH                     equ 0001h
ADLTHL_ADLTH7_MASK                       equ 0080h
ADLTHL_ADLTH_POSN                        equ 0000h
ADLTHL_ADLTH_POSITION                    equ 0000h
ADLTHL_ADLTH_SIZE                        equ 0008h
ADLTHL_ADLTH_LENGTH                      equ 0008h
ADLTHL_ADLTH_MASK                        equ 00FFh
ADLTHL_LTH0_POSN                         equ 0000h
ADLTHL_LTH0_POSITION                     equ 0000h
ADLTHL_LTH0_SIZE                         equ 0001h
ADLTHL_LTH0_LENGTH                       equ 0001h
ADLTHL_LTH0_MASK                         equ 0001h
ADLTHL_LTH1_POSN                         equ 0001h
ADLTHL_LTH1_POSITION                     equ 0001h
ADLTHL_LTH1_SIZE                         equ 0001h
ADLTHL_LTH1_LENGTH                       equ 0001h
ADLTHL_LTH1_MASK                         equ 0002h
ADLTHL_LTH2_POSN                         equ 0002h
ADLTHL_LTH2_POSITION                     equ 0002h
ADLTHL_LTH2_SIZE                         equ 0001h
ADLTHL_LTH2_LENGTH                       equ 0001h
ADLTHL_LTH2_MASK                         equ 0004h
ADLTHL_LTH3_POSN                         equ 0003h
ADLTHL_LTH3_POSITION                     equ 0003h
ADLTHL_LTH3_SIZE                         equ 0001h
ADLTHL_LTH3_LENGTH                       equ 0001h
ADLTHL_LTH3_MASK                         equ 0008h
ADLTHL_LTH4_POSN                         equ 0004h
ADLTHL_LTH4_POSITION                     equ 0004h
ADLTHL_LTH4_SIZE                         equ 0001h
ADLTHL_LTH4_LENGTH                       equ 0001h
ADLTHL_LTH4_MASK                         equ 0010h
ADLTHL_LTH5_POSN                         equ 0005h
ADLTHL_LTH5_POSITION                     equ 0005h
ADLTHL_LTH5_SIZE                         equ 0001h
ADLTHL_LTH5_LENGTH                       equ 0001h
ADLTHL_LTH5_MASK                         equ 0020h
ADLTHL_LTH6_POSN                         equ 0006h
ADLTHL_LTH6_POSITION                     equ 0006h
ADLTHL_LTH6_SIZE                         equ 0001h
ADLTHL_LTH6_LENGTH                       equ 0001h
ADLTHL_LTH6_MASK                         equ 0040h
ADLTHL_LTH7_POSN                         equ 0007h
ADLTHL_LTH7_POSITION                     equ 0007h
ADLTHL_LTH7_SIZE                         equ 0001h
ADLTHL_LTH7_LENGTH                       equ 0001h
ADLTHL_LTH7_MASK                         equ 0080h

// Register: ADLTHH
#define ADLTHH ADLTHH
ADLTHH                                   equ 01D0Dh
// bitfield definitions
ADLTHH_LTH_POSN                          equ 0000h
ADLTHH_LTH_POSITION                      equ 0000h
ADLTHH_LTH_SIZE                          equ 0008h
ADLTHH_LTH_LENGTH                        equ 0008h
ADLTHH_LTH_MASK                          equ 00FFh
ADLTHH_ADLTH8_POSN                       equ 0000h
ADLTHH_ADLTH8_POSITION                   equ 0000h
ADLTHH_ADLTH8_SIZE                       equ 0001h
ADLTHH_ADLTH8_LENGTH                     equ 0001h
ADLTHH_ADLTH8_MASK                       equ 0001h
ADLTHH_ADLTH9_POSN                       equ 0001h
ADLTHH_ADLTH9_POSITION                   equ 0001h
ADLTHH_ADLTH9_SIZE                       equ 0001h
ADLTHH_ADLTH9_LENGTH                     equ 0001h
ADLTHH_ADLTH9_MASK                       equ 0002h
ADLTHH_ADLTH10_POSN                      equ 0002h
ADLTHH_ADLTH10_POSITION                  equ 0002h
ADLTHH_ADLTH10_SIZE                      equ 0001h
ADLTHH_ADLTH10_LENGTH                    equ 0001h
ADLTHH_ADLTH10_MASK                      equ 0004h
ADLTHH_ADLTH11_POSN                      equ 0003h
ADLTHH_ADLTH11_POSITION                  equ 0003h
ADLTHH_ADLTH11_SIZE                      equ 0001h
ADLTHH_ADLTH11_LENGTH                    equ 0001h
ADLTHH_ADLTH11_MASK                      equ 0008h
ADLTHH_ADLTH12_POSN                      equ 0004h
ADLTHH_ADLTH12_POSITION                  equ 0004h
ADLTHH_ADLTH12_SIZE                      equ 0001h
ADLTHH_ADLTH12_LENGTH                    equ 0001h
ADLTHH_ADLTH12_MASK                      equ 0010h
ADLTHH_ADLTH13_POSN                      equ 0005h
ADLTHH_ADLTH13_POSITION                  equ 0005h
ADLTHH_ADLTH13_SIZE                      equ 0001h
ADLTHH_ADLTH13_LENGTH                    equ 0001h
ADLTHH_ADLTH13_MASK                      equ 0020h
ADLTHH_ADLTH14_POSN                      equ 0006h
ADLTHH_ADLTH14_POSITION                  equ 0006h
ADLTHH_ADLTH14_SIZE                      equ 0001h
ADLTHH_ADLTH14_LENGTH                    equ 0001h
ADLTHH_ADLTH14_MASK                      equ 0040h
ADLTHH_ADLTH15_POSN                      equ 0007h
ADLTHH_ADLTH15_POSITION                  equ 0007h
ADLTHH_ADLTH15_SIZE                      equ 0001h
ADLTHH_ADLTH15_LENGTH                    equ 0001h
ADLTHH_ADLTH15_MASK                      equ 0080h
ADLTHH_ADLTH_POSN                        equ 0000h
ADLTHH_ADLTH_POSITION                    equ 0000h
ADLTHH_ADLTH_SIZE                        equ 0008h
ADLTHH_ADLTH_LENGTH                      equ 0008h
ADLTHH_ADLTH_MASK                        equ 00FFh
ADLTHH_LTH8_POSN                         equ 0000h
ADLTHH_LTH8_POSITION                     equ 0000h
ADLTHH_LTH8_SIZE                         equ 0001h
ADLTHH_LTH8_LENGTH                       equ 0001h
ADLTHH_LTH8_MASK                         equ 0001h
ADLTHH_LTH9_POSN                         equ 0001h
ADLTHH_LTH9_POSITION                     equ 0001h
ADLTHH_LTH9_SIZE                         equ 0001h
ADLTHH_LTH9_LENGTH                       equ 0001h
ADLTHH_LTH9_MASK                         equ 0002h
ADLTHH_LTH10_POSN                        equ 0002h
ADLTHH_LTH10_POSITION                    equ 0002h
ADLTHH_LTH10_SIZE                        equ 0001h
ADLTHH_LTH10_LENGTH                      equ 0001h
ADLTHH_LTH10_MASK                        equ 0004h
ADLTHH_LTH11_POSN                        equ 0003h
ADLTHH_LTH11_POSITION                    equ 0003h
ADLTHH_LTH11_SIZE                        equ 0001h
ADLTHH_LTH11_LENGTH                      equ 0001h
ADLTHH_LTH11_MASK                        equ 0008h
ADLTHH_LTH12_POSN                        equ 0004h
ADLTHH_LTH12_POSITION                    equ 0004h
ADLTHH_LTH12_SIZE                        equ 0001h
ADLTHH_LTH12_LENGTH                      equ 0001h
ADLTHH_LTH12_MASK                        equ 0010h
ADLTHH_LTH13_POSN                        equ 0005h
ADLTHH_LTH13_POSITION                    equ 0005h
ADLTHH_LTH13_SIZE                        equ 0001h
ADLTHH_LTH13_LENGTH                      equ 0001h
ADLTHH_LTH13_MASK                        equ 0020h
ADLTHH_LTH14_POSN                        equ 0006h
ADLTHH_LTH14_POSITION                    equ 0006h
ADLTHH_LTH14_SIZE                        equ 0001h
ADLTHH_LTH14_LENGTH                      equ 0001h
ADLTHH_LTH14_MASK                        equ 0040h
ADLTHH_LTH15_POSN                        equ 0007h
ADLTHH_LTH15_POSITION                    equ 0007h
ADLTHH_LTH15_SIZE                        equ 0001h
ADLTHH_LTH15_LENGTH                      equ 0001h
ADLTHH_LTH15_MASK                        equ 0080h

// Register: ADUTHL
#define ADUTHL ADUTHL
ADUTHL                                   equ 01D0Eh
// bitfield definitions
ADUTHL_UTH_POSN                          equ 0000h
ADUTHL_UTH_POSITION                      equ 0000h
ADUTHL_UTH_SIZE                          equ 0008h
ADUTHL_UTH_LENGTH                        equ 0008h
ADUTHL_UTH_MASK                          equ 00FFh
ADUTHL_ADUTH0_POSN                       equ 0000h
ADUTHL_ADUTH0_POSITION                   equ 0000h
ADUTHL_ADUTH0_SIZE                       equ 0001h
ADUTHL_ADUTH0_LENGTH                     equ 0001h
ADUTHL_ADUTH0_MASK                       equ 0001h
ADUTHL_ADUTH1_POSN                       equ 0001h
ADUTHL_ADUTH1_POSITION                   equ 0001h
ADUTHL_ADUTH1_SIZE                       equ 0001h
ADUTHL_ADUTH1_LENGTH                     equ 0001h
ADUTHL_ADUTH1_MASK                       equ 0002h
ADUTHL_ADUTH2_POSN                       equ 0002h
ADUTHL_ADUTH2_POSITION                   equ 0002h
ADUTHL_ADUTH2_SIZE                       equ 0001h
ADUTHL_ADUTH2_LENGTH                     equ 0001h
ADUTHL_ADUTH2_MASK                       equ 0004h
ADUTHL_ADUTH3_POSN                       equ 0003h
ADUTHL_ADUTH3_POSITION                   equ 0003h
ADUTHL_ADUTH3_SIZE                       equ 0001h
ADUTHL_ADUTH3_LENGTH                     equ 0001h
ADUTHL_ADUTH3_MASK                       equ 0008h
ADUTHL_ADUTH4_POSN                       equ 0004h
ADUTHL_ADUTH4_POSITION                   equ 0004h
ADUTHL_ADUTH4_SIZE                       equ 0001h
ADUTHL_ADUTH4_LENGTH                     equ 0001h
ADUTHL_ADUTH4_MASK                       equ 0010h
ADUTHL_ADUTH5_POSN                       equ 0005h
ADUTHL_ADUTH5_POSITION                   equ 0005h
ADUTHL_ADUTH5_SIZE                       equ 0001h
ADUTHL_ADUTH5_LENGTH                     equ 0001h
ADUTHL_ADUTH5_MASK                       equ 0020h
ADUTHL_ADUTH6_POSN                       equ 0006h
ADUTHL_ADUTH6_POSITION                   equ 0006h
ADUTHL_ADUTH6_SIZE                       equ 0001h
ADUTHL_ADUTH6_LENGTH                     equ 0001h
ADUTHL_ADUTH6_MASK                       equ 0040h
ADUTHL_ADUTH7_POSN                       equ 0007h
ADUTHL_ADUTH7_POSITION                   equ 0007h
ADUTHL_ADUTH7_SIZE                       equ 0001h
ADUTHL_ADUTH7_LENGTH                     equ 0001h
ADUTHL_ADUTH7_MASK                       equ 0080h
ADUTHL_ADUTH_POSN                        equ 0000h
ADUTHL_ADUTH_POSITION                    equ 0000h
ADUTHL_ADUTH_SIZE                        equ 0008h
ADUTHL_ADUTH_LENGTH                      equ 0008h
ADUTHL_ADUTH_MASK                        equ 00FFh
ADUTHL_UTH0_POSN                         equ 0000h
ADUTHL_UTH0_POSITION                     equ 0000h
ADUTHL_UTH0_SIZE                         equ 0001h
ADUTHL_UTH0_LENGTH                       equ 0001h
ADUTHL_UTH0_MASK                         equ 0001h
ADUTHL_UTH1_POSN                         equ 0001h
ADUTHL_UTH1_POSITION                     equ 0001h
ADUTHL_UTH1_SIZE                         equ 0001h
ADUTHL_UTH1_LENGTH                       equ 0001h
ADUTHL_UTH1_MASK                         equ 0002h
ADUTHL_UTH2_POSN                         equ 0002h
ADUTHL_UTH2_POSITION                     equ 0002h
ADUTHL_UTH2_SIZE                         equ 0001h
ADUTHL_UTH2_LENGTH                       equ 0001h
ADUTHL_UTH2_MASK                         equ 0004h
ADUTHL_UTH3_POSN                         equ 0003h
ADUTHL_UTH3_POSITION                     equ 0003h
ADUTHL_UTH3_SIZE                         equ 0001h
ADUTHL_UTH3_LENGTH                       equ 0001h
ADUTHL_UTH3_MASK                         equ 0008h
ADUTHL_UTH4_POSN                         equ 0004h
ADUTHL_UTH4_POSITION                     equ 0004h
ADUTHL_UTH4_SIZE                         equ 0001h
ADUTHL_UTH4_LENGTH                       equ 0001h
ADUTHL_UTH4_MASK                         equ 0010h
ADUTHL_UTH5_POSN                         equ 0005h
ADUTHL_UTH5_POSITION                     equ 0005h
ADUTHL_UTH5_SIZE                         equ 0001h
ADUTHL_UTH5_LENGTH                       equ 0001h
ADUTHL_UTH5_MASK                         equ 0020h
ADUTHL_UTH6_POSN                         equ 0006h
ADUTHL_UTH6_POSITION                     equ 0006h
ADUTHL_UTH6_SIZE                         equ 0001h
ADUTHL_UTH6_LENGTH                       equ 0001h
ADUTHL_UTH6_MASK                         equ 0040h
ADUTHL_UTH7_POSN                         equ 0007h
ADUTHL_UTH7_POSITION                     equ 0007h
ADUTHL_UTH7_SIZE                         equ 0001h
ADUTHL_UTH7_LENGTH                       equ 0001h
ADUTHL_UTH7_MASK                         equ 0080h

// Register: ADUTHH
#define ADUTHH ADUTHH
ADUTHH                                   equ 01D0Fh
// bitfield definitions
ADUTHH_UTH_POSN                          equ 0000h
ADUTHH_UTH_POSITION                      equ 0000h
ADUTHH_UTH_SIZE                          equ 0008h
ADUTHH_UTH_LENGTH                        equ 0008h
ADUTHH_UTH_MASK                          equ 00FFh
ADUTHH_ADUTH8_POSN                       equ 0000h
ADUTHH_ADUTH8_POSITION                   equ 0000h
ADUTHH_ADUTH8_SIZE                       equ 0001h
ADUTHH_ADUTH8_LENGTH                     equ 0001h
ADUTHH_ADUTH8_MASK                       equ 0001h
ADUTHH_ADUTH9_POSN                       equ 0001h
ADUTHH_ADUTH9_POSITION                   equ 0001h
ADUTHH_ADUTH9_SIZE                       equ 0001h
ADUTHH_ADUTH9_LENGTH                     equ 0001h
ADUTHH_ADUTH9_MASK                       equ 0002h
ADUTHH_ADUTH10_POSN                      equ 0002h
ADUTHH_ADUTH10_POSITION                  equ 0002h
ADUTHH_ADUTH10_SIZE                      equ 0001h
ADUTHH_ADUTH10_LENGTH                    equ 0001h
ADUTHH_ADUTH10_MASK                      equ 0004h
ADUTHH_ADUTH11_POSN                      equ 0003h
ADUTHH_ADUTH11_POSITION                  equ 0003h
ADUTHH_ADUTH11_SIZE                      equ 0001h
ADUTHH_ADUTH11_LENGTH                    equ 0001h
ADUTHH_ADUTH11_MASK                      equ 0008h
ADUTHH_ADUTH12_POSN                      equ 0004h
ADUTHH_ADUTH12_POSITION                  equ 0004h
ADUTHH_ADUTH12_SIZE                      equ 0001h
ADUTHH_ADUTH12_LENGTH                    equ 0001h
ADUTHH_ADUTH12_MASK                      equ 0010h
ADUTHH_ADUTH13_POSN                      equ 0005h
ADUTHH_ADUTH13_POSITION                  equ 0005h
ADUTHH_ADUTH13_SIZE                      equ 0001h
ADUTHH_ADUTH13_LENGTH                    equ 0001h
ADUTHH_ADUTH13_MASK                      equ 0020h
ADUTHH_ADUTH14_POSN                      equ 0006h
ADUTHH_ADUTH14_POSITION                  equ 0006h
ADUTHH_ADUTH14_SIZE                      equ 0001h
ADUTHH_ADUTH14_LENGTH                    equ 0001h
ADUTHH_ADUTH14_MASK                      equ 0040h
ADUTHH_ADUTH15_POSN                      equ 0007h
ADUTHH_ADUTH15_POSITION                  equ 0007h
ADUTHH_ADUTH15_SIZE                      equ 0001h
ADUTHH_ADUTH15_LENGTH                    equ 0001h
ADUTHH_ADUTH15_MASK                      equ 0080h
ADUTHH_ADUTH_POSN                        equ 0000h
ADUTHH_ADUTH_POSITION                    equ 0000h
ADUTHH_ADUTH_SIZE                        equ 0008h
ADUTHH_ADUTH_LENGTH                      equ 0008h
ADUTHH_ADUTH_MASK                        equ 00FFh
ADUTHH_UTH8_POSN                         equ 0000h
ADUTHH_UTH8_POSITION                     equ 0000h
ADUTHH_UTH8_SIZE                         equ 0001h
ADUTHH_UTH8_LENGTH                       equ 0001h
ADUTHH_UTH8_MASK                         equ 0001h
ADUTHH_UTH9_POSN                         equ 0001h
ADUTHH_UTH9_POSITION                     equ 0001h
ADUTHH_UTH9_SIZE                         equ 0001h
ADUTHH_UTH9_LENGTH                       equ 0001h
ADUTHH_UTH9_MASK                         equ 0002h
ADUTHH_UTH10_POSN                        equ 0002h
ADUTHH_UTH10_POSITION                    equ 0002h
ADUTHH_UTH10_SIZE                        equ 0001h
ADUTHH_UTH10_LENGTH                      equ 0001h
ADUTHH_UTH10_MASK                        equ 0004h
ADUTHH_UTH11_POSN                        equ 0003h
ADUTHH_UTH11_POSITION                    equ 0003h
ADUTHH_UTH11_SIZE                        equ 0001h
ADUTHH_UTH11_LENGTH                      equ 0001h
ADUTHH_UTH11_MASK                        equ 0008h
ADUTHH_UTH12_POSN                        equ 0004h
ADUTHH_UTH12_POSITION                    equ 0004h
ADUTHH_UTH12_SIZE                        equ 0001h
ADUTHH_UTH12_LENGTH                      equ 0001h
ADUTHH_UTH12_MASK                        equ 0010h
ADUTHH_UTH13_POSN                        equ 0005h
ADUTHH_UTH13_POSITION                    equ 0005h
ADUTHH_UTH13_SIZE                        equ 0001h
ADUTHH_UTH13_LENGTH                      equ 0001h
ADUTHH_UTH13_MASK                        equ 0020h
ADUTHH_UTH14_POSN                        equ 0006h
ADUTHH_UTH14_POSITION                    equ 0006h
ADUTHH_UTH14_SIZE                        equ 0001h
ADUTHH_UTH14_LENGTH                      equ 0001h
ADUTHH_UTH14_MASK                        equ 0040h
ADUTHH_UTH15_POSN                        equ 0007h
ADUTHH_UTH15_POSITION                    equ 0007h
ADUTHH_UTH15_SIZE                        equ 0001h
ADUTHH_UTH15_LENGTH                      equ 0001h
ADUTHH_UTH15_MASK                        equ 0080h

